In [1]:
import pandas as pd

In [2]:
df = pd.read_csv( './files/username_c-sep.csv')

In [3]:
df

    Username   Identifier First name Last name
0   booker12         9012     Rachel    Booker
1     grey07         2070      Laura      Grey
2  johnson81         4081      Craig   Johnson
3  jenkins46         9346       Mary   Jenkins
4    smith79         5079      Jamie     Smith

In [4]:
df2 = pd.read_csv("./files/username_c-sep.csv" , index_col='First name')

In [5]:
df3 = pd.read_csv("./files/username_c-sep.csv" , index_col=2 )

In [6]:
df2

             Username   Identifier Last name
First name
Rachel       booker12         9012    Booker
Laura          grey07         2070      Grey
Craig       johnson81         4081   Johnson
Mary        jenkins46         9346   Jenkins
Jamie         smith79         5079     Smith

In [7]:
df3

             Username   Identifier Last name
First name
Rachel       booker12         9012    Booker
Laura          grey07         2070      Grey
Craig       johnson81         4081   Johnson
Mary        jenkins46         9346   Jenkins
Jamie         smith79         5079     Smith

In [8]:
df4 = pd.read_csv("./files/username_sc-sep .csv")

In [9]:
df4

  Username; Identifier;First name;Last name
0               booker12;9012;Rachel;Booker
1                    grey07;2070;Laura;Grey
2              johnson81;4081;Craig;Johnson
3               jenkins46;9346;Mary;Jenkins
4                  smith79;5079;Jamie;Smith

In [10]:
df5 =  pd.read_csv("./files/username_sc-sep .csv" , delimiter= ";")

In [11]:
df5

    Username   Identifier First name Last name
0   booker12         9012     Rachel    Booker
1     grey07         2070      Laura      Grey
2  johnson81         4081      Craig   Johnson
3  jenkins46         9346       Mary   Jenkins
4    smith79         5079      Jamie     Smith

In [12]:
!pip3 install xlrd

Requirement already satisfied: xlrd in /home/langscape/miniconda3/envs/django-env/lib/python3.6/site-packages (2.0.1)

In [13]:
!pip3 install xlwt

Requirement already satisfied: xlwt in /home/langscape/miniconda3/envs/django-env/lib/python3.6/site-packages (1.3.0)

In [14]:
!pip3 install openpyxl

Requirement already satisfied: openpyxl in /home/langscape/miniconda3/envs/django-env/lib/python3.6/site-packages (3.0.5)
Requirement already satisfied: jdcal in /home/langscape/miniconda3/envs/django-env/lib/python3.6/site-packages (from openpyxl) (1.4.1)
Requirement already satisfied: et-xmlfile in /home/langscape/miniconda3/envs/django-env/lib/python3.6/site-packages (from openpyxl) (1.0.1)

In [15]:
df_xl1 = pd.read_excel("./files/username.xlsx", engine="openpyxl" )

In [16]:
df_xl1

    Username   Identifier First name Last name
0   booker12         9012     Rachel    Booker
1     grey07         2070      Laura      Grey
2  johnson81         4081      Craig   Johnson
3  jenkins46         9346       Mary   Jenkins
4    smith79         5079      Jamie     Smith

In [17]:
df_xl2s3 = pd.read_excel ( "./files/username.xlsx" , engine="openpyxl" , sheet_name = "Sheet3")

In [18]:
df_xl2s3i = pd.read_excel ( "./files/username.xlsx" , engine="openpyxl" , sheet_name = 2 )

In [19]:
df_xl2s3

    Username   Identifier First name Last name
0   booker12         9012     Rachel    Booker
1     grey07         2070      Laura      Grey
2  johnson81         4081      Craig   Johnson

In [20]:
df_xl2s3i

    Username   Identifier First name Last name
0   booker12         9012     Rachel    Booker
1     grey07         2070      Laura      Grey
2  johnson81         4081      Craig   Johnson

In [21]:
df_xl_nr = pd.read_excel("./files/username.xlsx", engine="openpyxl" , nrows = 3 )

In [22]:
df_xl_nr

    Username   Identifier First name Last name
0   booker12         9012     Rachel    Booker
1     grey07         2070      Laura      Grey
2  johnson81         4081      Craig   Johnson

In [23]:
df_xl_sr = pd.read_excel("./files/username.xlsx", engine="openpyxl" ,skiprows=2, sheet_name = 1 )

In [24]:
df_xl_sr

    Username   Identifier First name Last name
0   booker12         9012     Rachel    Booker
1     grey07         2070      Laura      Grey
2  johnson81         4081      Craig   Johnson
3  jenkins46         9346       Mary   Jenkins
4    smith79         5079      Jamie     Smith

In [42]:
import sqlite3

In [43]:
conn = sqlite3.connect ( "./files/example.db" )

In [44]:
df_sql = pd.read_sql( "select * from Users" , con=conn )

In [45]:
df_sql

    Username  Identifier Firstname Lastname
0   booker12        9012    Rachel   Booker
1     grey07        2070     Laura     Grey
2  johnson81        4081     Craig  Johnson
3  jenkins46        9346      Mary  Jenkins
4    smith79        5079     Jamie    Smith

In [ ]:
#For POSTGRES DB
!pip3 install psycopg2
import psycopg2

conn = psycopg2.connect(
    host="localhost",
    database="your-db-name",
    user="username",
    password="password")
    
#FOR MYSQL DB
!pip3 install mysql-connector-python

import mysql.connector as msc 
conn = msc.connect ( 
    host="localhost",
    database="your-db-name",
    user="username",
    password="password")

In [ ]:
git clone https://github.com/Nandhakumarpro/python-data-analysis-tutorials.git